Revit 2027 API
SelectionUIOptions.SelectUnderlay Property
 Indicates whether elements that are displayed as underlay can be selected.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SelectUnderlay { get; set; }
Public Property SelectUnderlay As Boolean
	Get
	Set
public:
property bool SelectUnderlay {
	bool get ();
	void set (bool value);
}
member SelectUnderlay : bool with get, set
Property Value
Boolean
Remarks
 When this setting is false, if an element is displayed as underlay in a view then the user will not be able to select it in that view. The element may still be selected in views where it is not displayed as underlay. When this setting is true, elements that are displayed as underlay may still be selected.
See Also
Reference
SelectionUIOptions Class
Autodesk.Revit.UI Namespace